Repository: sebasmd-projects/cv-pag
Catalog: apps/project/spirit/rampone/locale/*/LC_MESSAGES/django.po
Languages: es

source: Flight Arrival
es: Vuelo llegando

source: Flight Departure
es: Vuelo saliendo

source: activity
es: actividad

source: description
es: descripción

source: 1.1 Activity
es: 1.1 Actividad

source: 1.1 Activities
es: 1.1 Actividades

source: user
es: usuario

source: completed date
es: fecha completada

source: completed time
es: tiempo completado

source: completed
es: completado

source: 1.2 Activity time entry
es: 1.2 Entrada de tiempo de actividad

source: 1.2 Activity time entries
es: 1.2 Entradas de tiempo de actividad

source: 1.0 CheckList
es: 1.0 Lista de verificación

source: Agent
es: Agente

source: Date
es: Fecha

source: Flight arrival
es: Vuelo llegando

source: Flight departure
es: Vuelo saliendo

source: license plate
es: Matrícula

source: winery 1 open
es: Apertura Bodega 1

source: winery 1 clousure
es: Cierre Bodega 1

source: first unloading of luggage
es: Primer desabordo

source: last unloading of luggage
es: Último desabordo

source: airplane winery inspection
es: inspección de bodega de avión

source: arrival of the first baggage shipping
es: Llegada primer envío (Diligencias)

source: arrival of the last baggage shipping
es: Llegada último envío (Diligencias)

source: rear ladder coupling begins
es: Acople escalera

source: rear ladder coupling end
es: Desacople escalera

source: maintenance arrival
es: Llegada mantenimiento

source: maintenance output
es: Salida mantenimiento

source: terpel arrival
es: Llegada Terpel

source: terpel output
es: Salida de Terpel

source: firefighters in
es: Llegada Bomberos

source: firefighters out
es: Salida Bomberos

source: plant coupling
es: Inicio de Planta

source: plant decoupling
es: Fin de Planta

source: baggage shipping
es: Envío de equipaje

source: baggage load cp1
es: Carga de equipaje CP1

source: airplane tire lock
es: Bloqueo

source: airplane push back
es: Push back

source: taxiing
es: Rodamiento/Taxiing

source: 2.0 Ramp One Data
es: 2.0 Datos Rampa Uno

source: Ramp One
es: Rampa Uno

source: content
es: contenido

source: Data Sheet
es: Hoja de Datos

source: Print
es: Imprimir

source: License Plate
es: Matrícula

source: Lock Airplane Tire
es: Bloqueo

source: Airplane Tire Lock
es: Bloqueo

source: Open Winery 1
es: Apertura Bodega 1

source: Closure Winery 1
es: Cierre Bodega 1

source: Begins Rear Ladder Coupling
es: Acople escalera

source: End Rear Ladder Coupling
es: Desacople escalera

source: First Unloading of Luggage
es: Primer desabordo

source: Last Unloading of Luggage
es: Último desabordo

source: Airplane Winery Inspection
es: Inspección de bodega de avión

source: First Arrival of the Baggage Shipping
es: Llegada primer envío (Diligencias)

source: Last Arrival of the Baggage Shipping
es: Llegada último envío (Diligencias)

source: Arrival Maintenace
es: Llegada Mantenimiento

source: Output Maintenace
es: Salida Mantenimiento

source: Save
es: Guardar

source: Activities
es: Actividades

source: Sebastián Morales - Guides, Checklist and others for Qualified Agent SPIRIT on the position of ramp one
es: Sebastián Morales - Guías, Lista de Verificación y otros para el Agente Calificado SPIRIT en la posición de la rampa uno

source: Sebastian Morales, Spirit, Airline, MDE, Longport
es: Sebastián Morales, Spirit, Aerolínea, MDE, Longport

source: Sebastian Morales | Spirit | Ramp One
es: Sebastián Morales | Espíritu | Rampa uno

source: Activity already completed today.
es: La actividad ya se ha completado hoy.
