Repository: sebasmd-projects/cv-pag
Catalog: apps/project/page/index/locale/*/LC_MESSAGES/django.po
Languages: es

source: Names
es: Nombres

source: Email
es: Correo

source: Subject
es: Asunto

source: Message
es: Mensaje

source: names
es: nombres

source: email
es: correo

source: subject
es: asunto

source: message
es: mensaje

source: Close
es: Cerrar

source: Send message
es: Enviar mensaje

source: Modified with love by
es: Modificado con amor por

source: Designed by
es: Diseñado por

source: Home
es: Inicio

source: About
es: Conóceme

source: Resume
es: Hoja de Vida

source: Profesional Experience
es: Experiencia Profesional

source: Education
es: Educación

source: Certifications
es: Certificaciones

source: Contact
es: Contáctame

source: Language
es: Idioma

source: Sebastián Morales - Developer and Automation QA with expertise in automated testing, Python, Java, C#, Selenium, Appium, and more. Experienced in creating automation frameworks and conducting API, manual, and functional testing. Available for employment opportunities to leverage skills in software development and quality assurance.
es: Sebastián Morales - Desarrollador y Asegurador de la Calidad con experiencia en pruebas automatizadas, Python, Java, C#, Selenium, Appium y más. Experiencia en la creación de marcos de automatización y realización de pruebas API, manuales y funcionales. Disponible para oportunidades de empleo para aprovechar las habilidades en desarrollo de software y control de calidad.

source: I am looking for an employment opportunity, where I can take advantage of my organizational, communication and leadership skills in the development or automation of quality assurance and processes.
es: Estoy buscando una oportunidad de empleo, donde pueda aprovechar mis habilidades organizativas, comunicativas y de liderazgo en el desarrollo o la automatización de procesos y aseguramiento de la calidad.

source: Backend Developer &amp; QA (Automation/Functional)
es: Desarrollador Backend &amp; QA (Automatizador/Manual)

source: Solid experience in software development and automation, leading work teams, optimizing processes and improving continuous software quality.
es: Sólida experiencia en desarrollo y automatización de software, liderando equipos de trabajo, optimizando procesos y mejorando continuamente la calidad del software.

source: Email:
es: Correo:

source: Phone:
es: Celular:

source: Residence:
es: Dirección:

source: Availability:
es: Disponibilidad:

source: Available
es: Disponible

source: Age:
es: Edad

source: Degree:
es: Título

source: Systems Ing. (Student)
es: Ing. de Sistemas (Estudiante)

source: Website:
es: Sitio:

source: Committed to contributing to the success of each project, either in promoting efficiency and excellence in software development or product quality.
es: Comprometido a contribuir al éxito de cada proyecto, ya sea promoviendo la eficiencia y excelencia en el desarrollo de software o la calidad del producto.

source: What would you like to talk about?
es: ¿Qué te gustaría hablar conmigo?

source: Address
es: Dirección

source: Call Me
es: Llámame

source: Email Me
es: Escríbeme

source: Send Message
es: Enviar Mensaje

source: I'm
es: Soy

source: Developer, Quality Assurance, Freelancer
es: Desarrollador, Analista de Calidad, Freelancer

source: I am a web application developer with the Django framework of Python and Next.js of React.
es: Soy desarrollador de aplicaciones web con el framework Django de Python y Next.js de React.

source: I have built content management applications, educational platforms, and implemented payment gateways.
es: He creado aplicaciones de gestión de contenidos, plataformas educativas e implementado pasarelas de pago.

source: Additionally, I have experience in developing customer relationship management (CRM) systems, enterprise resource planning (ERP) systems, and residential management systems (RMS).
es: Además, tengo experiencia en el desarrollo de sistemas de gestión de relaciones con los clientes (CRM), sistemas de planificación de recursos empresariales (ERP) y sistemas de gestión residencial (RMS).

source: I have also worked on third-party service integrations, enhancing the functionality and efficiency of the applications I develop.
es: También he trabajado en integraciones de servicios de terceros, mejorando la funcionalidad y eficiencia de las aplicaciones que desarrollo.

source: I have implemented CI/CD with Azure DevOps. As a Quality Analyst, I have a solid knowledge of ISTQB standards.
es: Implementé CI/CD con Azure DevOps. Como Analista de Calidad tengo un sólido conocimiento de los estándares ISTQB.

source: I like to be a leader, work in a team, and apply critical thinking to provide the best solutions for the company.
es: Me gusta ser líder, trabajar en equipo y aplicar el pensamiento crítico para brindar las mejores soluciones para la empresa.

source: Professional Experience
es: Experiencia Profesional

source: Senior Quality Assurance Engineer
es: Ingeniero Senior de Aseguramiento de Calidad

source: Dec 2021 - Aug 2023
es: Dic 2021 - Ago 2023

source: QA Automation
es: Automatización de control de calidad

source: Design, develop, and maintain automated test scripts.
es: Diseñar, desarrollar y mantener scripts de prueba automatizados.

source: Design test cases and scenarios for automated testing.
es: Diseñar casos de prueba y escenarios para pruebas automatizadas.

source: Implement automated testing frameworks and tools.
es: Implementar frameworks y herramientas de prueba para la automatización.

source: Analyze requirements and specifications to create detailed test plans.
es: Analicé requisitos y especificaciones para crear planes de prueba detallados.

source: Execute automated tests and evaluate results.
es: Ejecuté las pruebas automatizadas y evalué los resultados.

source: Identify, record, document, and track defects.
es: Identifiqué, registré, documenté y rastreé los defectos.

source: Generate test reports and metrics to communicate test results.
es: Generé informes de prueba y métricas para comunicar los resultados de las pruebas.

source: Integrate automated tests into the CI/CD pipeline.
es: Integré pruebas automatizadas en el proceso de CI/CD.

source: Update and maintain existing automated test scripts as the application evolves.
es: Actualicé y mantuve los scripts de prueba automatizados existentes a medida que evoluciona la aplicación.

source: Refactor and optimize code for better performance and reliability.
es: Refactoricé y optimicé el código para un mejor rendimiento, confiabilidad y escalabilidad.

source: Develop and execute performance and load tests.
es: Desarrollé y ejecuté pruebas de rendimiento y carga.

source: Participate in sprint planning, daily stand-ups, and retrospective meetings.
es: Participé en la planificación de sprints, stand-ups diarios y reuniones retrospectivas.

source: Train and mentor team members on automation tools and best practices.
es: Capacité y asesoré a los miembros del equipo sobre herramientas de automatización y mejores prácticas.

source: Work closely with developers and other stakeholders to understand application functionality and improve test processes.
es: Trabaje en estrecha colaboración con desarrolladores y otras partes interesadas para comprender la funcionalidad de la aplicación y mejorar los procesos de prueba.

source: Ensure automated tests cover compliance requirements.
es: Me aseguré de que las pruebas automatizadas cubran los requisitos de cumplimiento.

source: Implement security testing practices within the automation framework.
es: Implementar prácticas de pruebas de seguridad dentro del marco de automatización.

source: API Testing
es: Pruebas API

source: Create detailed test plans and test cases based on API documentation and requirements.
es: Creé planes de prueba detallados y casos de prueba basados ​​en la documentación y los requisitos de API.

source: Identify the different types of tests needed, such as functional, performance, security, and usability tests.
es: Identifiqué los diferentes tipos de pruebas necesarias, como pruebas funcionales, de rendimiento, de seguridad y de usabilidad.

source: Monitored API performance and optimized test cases for better coverage.
es: Supervisé el rendimiento de la API y optimicé los casos de prueba para una mejor cobertura.

source: Perform security testing to identify vulnerabilities such as SQL injection, cross-site scripting (XSS), and unauthorized access.
es: Realicé pruebas de seguridad para identificar vulnerabilidades como inyección SQL, secuencias de comandos entre sitios (XSS) y acceso no autorizado.

source: Manual and Functional Testing
es: Pruebas manuales y funcionales

source: Define the scope, objectives, and strategy for manual and functional testing.
es: Definí el alcance, objetivos y estrategia para pruebas manuales y funcionales.

source: Create detailed test plans and test cases based on requirements, specifications, and user stories.
es: Creé planes de prueba detallados y casos de prueba basados ​​en requisitos, especificaciones e historias de usuarios.

source: Design and document test cases and test scenarios that cover all functional aspects of the application.
es: Diseñé y documenté casos de prueba y escenarios de prueba que cubren todos los aspectos funcionales de la aplicación.

source: Feb 2018 - Dec 2021
es: Feb 2018 - Dic 2021

source: CRM and ERP
es: CRM y ERP

source: Conducted user training and created documentation to facilitate smooth adoption and effective use of the CRM system.
es: Realicé capacitación de usuarios y creé documentación para facilitar la adopción fluida y el uso efectivo del sistema CRM.

source: Designed and implemented API REST using Django and Django REST Framework to support CRM functionality.
es: Diseñé e implementé API REST utilizando Django y Django REST Framework para admitir la funcionalidad CRM.

source: Developed and managed server-side logic, including data processing and business logic for the CRM system.
es: Desarrollé y administré lógica del lado del servidor, incluido el procesamiento de datos y la lógica de negocios para el sistema CRM.

source: Ensured data integrity and performed regular database maintenance using Django's ORM.
es: Garanticé la integridad de los datos y realicé el mantenimiento regular de la base de datos utilizando el ORM de Django.

source: Integrated third-party services and APIs to enhance CRM capabilities.
es: Integré los servicios y API de terceros para mejorar las capacidades de CRM.

source: Moodle (E-Learning Education Platform)
es: Moodle (Plataforma educativa de aprendizaje virtual)

source: Customized Moodle themes and templates to enhance the user interface and user experience for both students and instructors.
es: Personalicé los temas y plantillas de Moodle para mejorar la interfaz de usuario y la experiencia del usuario tanto para estudiantes como para profesores.

source: Integrated external tools and resources, such as video conferencing and collaborative tools, into the Moodle platform.
es: Integré herramientas y recursos externos, como videoconferencias y herramientas colaborativas, a la plataforma Moodle.

source: Implemented automated testing scripts to ensure the stability and functionality of Moodle upgrades and new features.
es: Implementé scripts de prueba automatizados para garantizar la estabilidad y funcionalidad de las actualizaciones y nuevas funciones de Moodle.

source: Sentinel (Medical Qualification Software)
es: Sentinel (software de calificación médica)

source: Computer Engineer (Student)
es: Ingeniería Informática (Estudiante)

source: 2021 - Now
es: 2021 - Ahora

source: Systems Engineer (Student)
es: Ingeniería de Sistemas (Estudiante)

source: Python University with Frameworks Django, Flask, etc.
es: Universidad Python - De Cero a Experto Más Completo

source: Python 3 Master Course: Learn from Scratch.
es: Curso Maestro de Python: De Cero a Programador Todoterreno

source: Django with React | An Ecommerce Website
es: Django con React | Ecommerce

source: Course Django and Django rest framework from basic to professional
es: Curso Django y Django rest framework de básico a profesional

source: Purchase and Billing System with Python using Django LTS
es: Sistema de Compra y Facturación con Python usando Django

source: Django Hands-On Course: Backend Web Development with Python
es: Curso Práctico de Django: Desarrollo Web Backend con Python

source: Python for non-mathematicians: From 0 to facial recognition
es: Python para no matemáticos: De 0 hasta reconocimiento facial

source: Machine Learning with Python
es: Python y Machine Learning: Crea Soluciones Innovadoras

source: Java University - From Zero to Expert - More Complete
es: Universidad Java - De Cero a Experto - Más Completo

source: JavaScript University - From Zero to JavaScript Expert
es: Universidad JavaScript - De Cero a Experto JavaScript!

source: Watched
es: Videos

source: WEB Automation – Serenity BDD | cucumber | Screen Play | Java
es: Automatización - Serenity BDD | cucumber | Screen Play | Java

source: Selenium with Python Behave (BDD)
es: Selenium con Python Behave (BDD)

source: Python with Selenium Course
es: Curso de Python con Selenium

source: Selenium with Java and Cucumber: The definitive Course
es: Selenium con Java y Cucumber: El curso definitivo

source: QA Automation with Serenity Course - From novice to expert!
es: Curso de automatización del aseguramiento de la calidad con Serenity - De novato a experto!

source: UI Automation with Serenity BDD (Selenium, Cucumber, Junit)
es: Automatización de UI con Serenity BDD (Selenium, Cucumber, Junit)

source: Skills
es: Habilidades

source: Platforms, Technologies, Languages
es: Plataformas, Tecnologías, Lenguajes

source: English (B2)
es: Ingles (B2)
